PHRASES_FOR_MESSAGE = {
    'start_command': (
        'привет!\n\nЯ помогаю найти работу людям с инвалидностью\n'
        'Вы готовы начать вводить данные?\n\n'
        'Если вам нужна справка, вы всегда можете\n'
        'воспользоваться командой /help\n'
        'или прямо сейчас нажать кнопку "Справка по боту"'
    ),
    'help_command': (
        'я хотел бы рассказать тебе, что я могу!\n\n'
        '<b>Telegram bot Work for everyone позволяет:</b>\n'
        '- искать вакансии в указанном пользователем населенном пункте;\n'
        '- просматривать список вакансий с краткой информацией о ней;\n'
        '- получать подробную информацию о конкретной вакансии;\n'
        '- добавлять вакансии в Избранное.\n\n'
        '<b>Как получить список интересующих вакансий:</b>\n'
        '- на первом шаге тебе нужно выбрать из списка федеральный округ.\n'
        '- далее нужно выбрать из списка регион\n'
        '- после выбора федерального округа и региона нужно ввести'
        'название населенного пункта (город, село, поселок и т.п.,), '
        'в котором ты хотел бы посмотреть вакансии\n'
        '- если все данные введены верно, жми кнопку "Начать поиск вакансий"\n'
        '- если в данных ошибка, жми кнопку "Ввести данные повторно"\n'
        '- вакансии будут показываться списком, по 10 вакансий за один раз.'
        'Ты можешь листать список вакансий как вперёд, так и назад.\n'
        '- под каждой вакансией будут две кнопки: '
        '"Добавить в "Избранное" и "Подробнее о вакансии"\n\n'
        'После просмотра подробной информации о вакансии ты можешь вернуться '
        'обратно к списку вакансий.\n\n'
        'После того как будет закончена работа с ботом, все найденные '
        'вакансии будут удалены, кроме тех вакансий, которые добавлены '
        'в "Избранное". Они будут доступны, пока ты сам их не удалишь.\n\n'
        '<b>Доступные команды в боте:</b>\n'
        '- /start - начало работы с ботом;\n'
        '- /help - получить справку по работе с ботом;\n'
        '- /cancel - завершение работы с ботом;\n'
        '- /favorites - посмотреть вакансии, добавленные в "Избранное"\n\n'
        '<b>Вперёд!!!</b>'
    ),
    # 'start_command_yes': (
    #     'для того, чтобы подобрать для вас вакансии, мне нужно узнать,'
    #     'в каком регионе вы проживаете и в каком населенном пункте'
    #     'Сначало выбирете ваш федеральный округ'
    # ),
    # 'input_name_locality': (
    #     'убедитесь, пожалуйста, что название'
    #     'населенного пункта введенно корректно.'
    # ),
    # 'choice_federal_districts': (
    #     'выбирите из списка необходимые регион.'
    # ),
    # 'choice_federal_districts_worning': (
    #     'на данном этапе вам необходимо выбрать из списка'
    #     'эваше федеральный округ, для дальнейшего выбора региона,'
    #     'в котором вы хотели бы найти работу.\n'
    #     'Если вам нужна справка по работе с ботом, используйте команду /help'
    # ),
    # 'choice_region': (
    #     'отлично! теперь нужно указать населенный пункт,'
    #     'в котором вы хотели бы найти работу.'
    # ),
    # 'choice_region_worning': (
    #     'на данном этапе вам необходимо выбрать из списка'
    #     'регион, в котором вы хотели бы найти работу.\n'
    #     'Если вам нужна справка по работе с ботом, используйте команду /help'
    # ),
    # 'local_name_processing': (
    #     'все данные введены, я готов преступить к поиску вакансий.'
    #     'Прежде чем начинать, предлагаю убедиться, что данные корректны.'
    # ),
    'other_answer': (
        ', прошу прощения, но я получил сообщение, которое не могу '
        'обработать!\n\nНе забывай, ты всегда можешь получить справку '
        'по работе со мной, отправив команду /help '
        'или нажав кнопку "Справка по боту", которая прикреплена к '
        'этому сообщению ниже\n\nУдачи!'
    )
}
