TEXT_FOR_BUTTON = {
    'ready': 'Готов!',
    'bot_help': 'Справка по боту',
    'data_input': 'Начать ввод данных',
    'federal_districts': {
        'Центральный федеральный округ': 30,
        'Северо-Западный федеральный округ': 31,
        'Приволжский федеральный округ': 33,
        'Уральский федеральный округ': 34,
        'Северо-Кавказский федеральный округ': 38,
        'Южный федеральный округ': 40,
        'Сибирский федеральный округ': 41,
        'Дальневосточный федеральный округ': 42,
    },
    'back_to_selection_f_d': 'Вернуться к выбору ФО',
    're_enter_data': 'Ввести данные заново',
    'start_searching': 'Начать поиск вакансий',
}
